## Pandas
Pndas are open source library buult over Numpy. Pandas are simillar to Excel, with a lot more features. Pandas also have data visualization features. In this review we will cover concepts in pandas mainly:
Series
* Series
* DataFrames 
* Missing Data
* GroupBy
* Merging,Joining,and Concatenating
* Operations
* Data Input and Output

In [2]:
# Series - similar to numpy array but indexed by label
# Lets first import the numpy and pandas libraries

In [3]:
import numpy as np
import pandas as pd

In [4]:
#Lests create different objects
labels = ['a', 'b', 'c'] # python object/list
my_data = [10,20,30]  # python object/list
arr = np.array(my_data) # numpy array
d = {'a':10, 'b':20, 'c':30} # python dictionary

In [6]:
# We can check the contents of the objects as follows
labels

['a', 'b', 'c']

In [7]:
my_data

[10, 20, 30]

In [8]:
arr

array([10, 20, 30])

In [9]:
d

{'a': 10, 'b': 20, 'c': 30}

In [12]:
# We can then create a pandas series as 
pd.Series(data=my_data) # Takes data and index here default

0    10
1    20
2    30
dtype: int64

In [13]:
#pandas series with explicit indexing # labeled series

a    10
b    20
c    30
dtype: int64

In [14]:
# We can also use this
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [15]:
# We can also pass numoy array as a data to pandas series
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [16]:
d

{'a': 10, 'b': 20, 'c': 30}

In [17]:
# Pnada series has variety of types compared to np array
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [20]:
# And also - list of keywords not strings
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [22]:
ser1 = pd.Series([1,2,3,4],['USA', 'Germany', 'Tigray', 'Ireland'])
ser1

USA        1
Germany    2
Tigray     3
Ireland    4
dtype: int64

In [23]:
ser2 = pd.Series([1,2,5,4],['USA', 'Germany', 'Italy', 'Ireland'])
ser2

USA        1
Germany    2
Italy      5
Ireland    4
dtype: int64

In [24]:
# We can access the elements like in numpy arrays
ser1['USA']

1

In [25]:
ser3 = pd.Series(data=labels)

In [26]:
#Returns the data corresponding to the index like in numpy
ser3[0]

'a'

In [33]:
#Lets set a seed for random numbers
from numpy.random import randn
np.random.seed(101)

In [27]:
# This tries to match the list and retuns NAN when there is no match
ser1 + ser2

Germany    4.0
Ireland    8.0
Italy      NaN
Tigray     NaN
USA        2.0
dtype: float64

* Data Frams
Covers important section of pandas

In [34]:
# The data frame comamnd
# The arguments are data -randn, index and columns
df= pd.DataFrame(randn(5,4),['A', 'B', 'C', 'D','E'],['w','x','y','z']) # data, index and columns arguments
df

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
# In the above data frame w, x, y, z are each pandas serieses
df['w']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: w, dtype: float64

In [36]:
# We can confirm this using the type 
type(df['w'])

pandas.core.series.Series

In [38]:
# We can also gram the pandas series as follows
df.w # This might not be good practice as columns may overwitre methods

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: w, dtype: float64

In [40]:
# Creating new column
df['new'] = df['w'] + df['y']
df

          w         x         y         z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [43]:
# We use the drop method to delete a column
df.drop('new', axis=1) # we should specify the axis to column

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [44]:
# The above change will not be infornced in the data frame
df

          w         x         y         z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [46]:
# To make the change permanent we use inplace paramenter
df.drop('new', axis=1, inplace=True) # permanent change
df

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [50]:
# we can also use drop method to drop a row
df.drop('E') # default axis is taken

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [51]:
# We can also explicitly specify the axis to 0, row
df.drop('B', axis=0) # not permanent as no inplace

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
# We can check the shape of the data frame as
df.shape # shows 5 rows and 4 columns

(5, 4)

In [53]:
# Rows are 0 axis and columns are 1 axis

In [54]:
#Selecting rows usinf loc
df.loc['A']

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: A, dtype: float64

In [55]:
# This shows that the rows are also serieses
# We can also use the indx based accessing of rows
df.iloc[2] # displays row in index 2 - third row or C

w   -2.018168
x    0.740122
y    0.528813
z   -0.589001
Name: C, dtype: float64

In [58]:
# We can also access single cell using
df.loc['B', 'y']

-0.8480769834036315

In [59]:
# Or this to access some sub data frame like folows
df.loc[['A', 'B'], ['w', 'y']]

          w         y
A  2.706850  0.907969
B  0.651118 -0.848077

* Next we will see Conditional selection and Multi index

In [60]:
df > 0 # gives us data farme of bolean values

       w      x      y      z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [63]:
#Conditional selection based on some condition
bool_df = df>0
df[bool_df] # displays the values that satisfy the condition

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [64]:
# We can also use this in short
df[df>0]

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [68]:
df['w']>0

A     True
B     True
C    False
D     True
E     True
Name: w, dtype: bool

In [69]:
df[df['w']>0] # returns the rows that satisfy w>0 condition

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [70]:
df[df['z']<0] #

          w         x         y         z
C -2.018168  0.740122  0.528813 -0.589001

In [71]:
# Only one row satisfies the condition as can be seen here
df

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [72]:
# We can also asign the result to a new data frame
result = df[df['w']>0]
result

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [73]:
# And access a specific colunn of the new data frame
result['x']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: x, dtype: float64

In [74]:
# We can also put this all into one step
df[df['w']>0]['x']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: x, dtype: float64

In [75]:
# Example sing long and short ways
df[df['w']>0][['x','y']]

          x         y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [76]:
#The above is a short version of 
booler = df['w']>0
result = df[booler]
mycols = ['x','y']
result[mycols]

          x         y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [77]:
# multiple conditions in pandas data frame
df[(df['w']>0) and (df['y']>1)] # this gives error

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [78]:
# The truth value of a Series is ambiguous
# because a python conditional operator can only take single boolean value
# So we use the & operator instead of and
df[(df['w']>0) & (df['y']>1)]

          w         x         y         z
E  0.190794  1.978757  2.605967  0.683509

In [79]:
# And use | instead of python normal or operator likewise
df[(df['w']>0) | (df['y']>1)]

          w         x         y         z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [80]:
# Not
df[(df['w']>0) or (df['y']>1)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [83]:
# Reseting index
df.reset_index()

  index         w         x         y         z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [84]:
# This does not remove the old labeled indexes
# also we have to use inplace if we want make the change permanent

In [86]:
# We can also be creative in creating index like 
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [87]:
df['States'] = newind

In [88]:
df

          w         x         y         z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [90]:
# To make the above index of the data frame we use the set method
df.set_index('States') # not reset

               w         x         y         z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [91]:
df # this will not be effective unless we use inplace=true

          w         x         y         z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

* Multi index and index hierarchy

In [92]:
# Index levels
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [93]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [94]:
inside

[1, 2, 3, 1, 2, 3]

In [95]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [96]:
dff = pd.DataFrame(randn(6,2),hier_index,['A','B'])
dff # Multi indexed data frame

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [98]:
# Call data from multi indexed data farme
dff.loc['G1'] # this grabs the section of G1 data farne

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [100]:
# We can also grab a subset of this group using another loc method
dff.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [102]:
# Check the index name using the names method
dff.index.names # The indices do not have names None

FrozenList([None, None])

In [103]:
dff

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [105]:
# To grab 0.072960
dff.loc['G2']

          A         B
1  0.166905  0.184502
2  0.807706  0.072960
3  0.638787  0.329646

In [106]:
# and then
dff.loc['G2'].loc[2]['B'] # which gives us the number

0.07295967531703869

In [107]:
# Exercise: Try to grab the value in the G2, row 3 column A
dff

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [108]:
#Answer 
dff.loc['G2'].loc[3]['A']

0.638787013499328

In [110]:
# the cross section function - can skip into multi level index
# Lests say we want to grab everything under G1
dff.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [112]:
# We can also do this using the xs function as follows
dff.xs('G1')

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [116]:
dff

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [120]:
# Lets grab the values with index = 1
dff.xs(1,level=1)

           A         B
G1  0.302665  1.693723
G2  0.166905  0.184502

# Missing Values in pandas
In this section we see how we can handle missing values in pandas
* Fill in missing values
* Drom missing values

In [124]:
# Lests create a dictionary 
d = {'A':[1,2,np.nan], 'B':[5,np.nan, np.nan], 'C':[1,2,3]}
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [126]:
dfff = pd.DataFrame(d)
dfff

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [127]:
# Dropping missing values
dfff.dropna() # drops all rows with missing values

     A    B  C
0  1.0  5.0  1

In [128]:
# We can use the axis option to drop colums with missing values
dfff.dropna(axis=1)

   C
0  1
1  2
2  3

In [129]:
# We can specify the limit of na valued for dropping
dfff.dropna(thresh=2) # drops rows with at least 2 missing values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [130]:
# Filling in missing values
dfff.fillna(value=3)

     A    B  C
0  1.0  5.0  1
1  2.0  3.0  2
2  3.0  3.0  3

In [132]:
dfff

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [131]:
# We can also fill missing values with min, max or other values
dfff['A'].fillna(value=dfff['A'].mean()) # average is put

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [133]:
# We can use this in general like 
dfff.fillna(value=dfff.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [134]:
# We use the thresh and value argument in the above methods

# Group by
Groups rows together based on a column and performs aggregate function on them

In [139]:
#Lets use the dictionary
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [140]:
dffff = pd.DataFrame(data)

In [141]:
dffff

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [144]:
byCamp = dffff.groupby('Company')

In [145]:
byCamp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [146]:
byCamp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [147]:
byCamp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [148]:
byCamp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [149]:
# We can also put all the above in one line as follows
dffff.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [150]:
dffff.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [151]:
dffff.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [152]:
dffff.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [153]:
# We often use group by with discribe method
dffff.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [154]:
# We can also transpose to improve redeability
dffff.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [156]:
# Or for specific company
dffff.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

# Merging, Joining and Concatinating Data Frames

In [166]:
x = pd.DataFrame(np.random.rand(2,3))
y = pd.DataFrame(np.random.rand(2,3))
x = pd.DataFrame(np.random.rand(2,3))

In [169]:
# Concatination - on axis 0 or rows concatination
z = pd.concat([x,y],axis=0)
z

          0         1         2
0  0.080104  0.607216  0.630847
1  0.377942  0.013241  0.842219
0  0.975361  0.203528  0.299020
1  0.227656  0.048169  0.903971

In [170]:
# concatnate on colums
z = pd.concat([x,y],axis=1)
z

          0         1         2         0         1         2
0  0.080104  0.607216  0.630847  0.975361  0.203528  0.299020
1  0.377942  0.013241  0.842219  0.227656  0.048169  0.903971

In [171]:
# Merging data frames
pd.merge(x,y)

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [172]:
# Merging data frames variety
pd.merge(x,y, how='outer')

          0         1         2
0  0.080104  0.607216  0.630847
1  0.377942  0.013241  0.842219
2  0.975361  0.203528  0.299020
3  0.227656  0.048169  0.903971

In [174]:
# Merging data frames variety
pd.merge(x,y, how='right')

          0         1         2
0  0.975361  0.203528  0.299020
1  0.227656  0.048169  0.903971

In [175]:
# Merging data frames variety
pd.merge(x,y, how='left')

          0         1         2
0  0.080104  0.607216  0.630847
1  0.377942  0.013241  0.842219

In [176]:
# Similar to sql merge schema

# Operations

In [182]:
#Find unique values
df['w'].unique()

array([ 2.70684984,  0.65111795, -2.01816824,  0.18869531,  0.19079432])

In [183]:
# We can also use count and other methods

In [184]:
#Apply method
def times2(x):
    return x*2

In [185]:
# In pandas we use apply 
df['w'].apply(times2)

A    5.413700
B    1.302236
C   -4.036336
D    0.377391
E    0.381589
Name: w, dtype: float64

In [193]:
s = np.arange(5)
f = pd.DataFrame(s)
f

   0
0  0
1  1
2  2
3  3
4  4

In [194]:
f.apply(times2)

   0
0  0
1  2
2  4
3  6
4  8